INSERT INTO Zavod.roles(role)
VALUES
('DEVELOPER'),
('ADMIN');

INSERT INTO Zavod.users(username, name, surname, patronymic, password, is_deleted)
VALUES
('isakhno', 'Ярослав', 'Сахно', 'Андреевич', '$2a$10$DimBen9baU6AzZi.O2q/WusIS6OflyWa092jAIaqdfQ8GevBrta8S', 0),
('amusina', 'Анастасия', 'Мусина', 'Руслановна', '$2a$10$DimBen9baU6AzZi.O2q/WusIS6OflyWa092jAIaqdfQ8GevBrta8S', 0);

INSERT INTO Zavod.user_role(user_id, role_id)
VALUES
(1,1),
(2,2);

INSERT INTO Zavod.categories(name)
VALUES
('Бутылки'),
('Банки'),
('Прес формы'),
('Крышки'),
('Флекс');

INSERT INTO Zavod.subcategories(name, category_id)
VALUES
('Бутылки 0.5 л', 1),
('Бутылки 1 л', 1),
('Бутылки 0.45 л', 1),
('Бутылки 1.5 л', 1),
('Бутылки 2 л', 1),
('Бутылки 2.5 л', 1),
('Бутылки 3 л', 1),
('Бутылки 4 л', 1),--8
('Бутылки 0.83 л', 1),--9
('Бутылки 0.9 л', 1),--10
('Бутылки 0.25 л', 1),--11
('Бутылки 0.3 л', 1),--12
('Бутылки 0.33 л', 1),--13
('Бутылки 0.2 л', 1),--14
('Бутылки 0.1 л', 1),--15
('Бутылки 0.4 л', 1),--16
('Банки 1 л', 2),--17
('Банки 2 л', 2),--18
('Пре форма 0.5 л', 3),--19
('Пре форма 1 л', 3),--20
('Пре форма 1.5 л', 3),--21
('Крышки на бутылку', 4),--22
('Крышки на банку', 4),--23
('Флекс лента', 5),--24
('Флекс стружка', 5),--25
('Флекс стружка', 5),--26
('Банки 0.5 л', 2),--27
('Банки 1.04 л', 2),--28
('Банки 0.65 л', 2),--29
('Банки 0.45 л', 2),--30
('Банки 0.76 л', 2),--31
('Банки 3 л', 2),--32
('Банки 4 л', 2),--33
('Банки 5 л', 2),--34
('Банки 0.3 л', 2),--35
('Банки 0.7 л', 2);--36

INSERT INTO Zavod.colors(name, hex_code)
VALUES
('Прозрачный', '#FFFFFF00'),
('Зеленый', '#219c23'),
('Коричневый', '#994d17'),
('Белый', '#fcf9f7'),
('Голубой', '#99CCFF');

INSERT INTO Zavod.characteristics(name)
VALUES
('Цена'),
('Объем'),
('Фасовка'),
('Диаметр горлышка, мм'),
('Масса'),
('Диаметр, мм');--6

INSERT INTO Zavod.Products(name, id_from_factory_bd, subcategory_id)
VALUES
('Бутылка 1л', 1, 2),
('Бутылка 1л', 43, 2),
('Бутылка 1л', 163, 2),
('Бутылка 1л', 266, 2),
('Бутылка 1л', 10, 2),
('Бутылка 1л', 44, 2),
('Бутылка 1л', 36, 2),
('Бутылка 1л', 75, 2),
('Бутылка 1л', 161, 2),
('Бутылка 1л', 76, 2),
('Бутылка 1л', 101, 2),
('Бутылка 1л', 210, 2),
('Бутылка 1л', 79, 2),
('Бутылка 1л', 115, 2),
('Бутылка 1л', 139, 2),
('Бутылка 0.5л', 119, 1),
('Бутылка 0.5л', 88, 1),
('Бутылка 0.5л', 118, 1),
('Бутылка 0.5л', 15, 1),
('Бутылка 0.5л', 28, 1),
('Бутылка 0.5л', 51, 1),
('Бутылка 0.5л', 42, 1),
('Бутылка 0.5л', 78, 1),
('Бутылка 0.5л', 82, 1),
('Бутылка 0.5л', 122, 1),
('Бутылка 0.5л', 164, 1),
('Бутылка 0.45л', 184, 3),--27
('Бутылка 1.5л', 48, 4),--28
('Бутылка 1.5л', 12, 4),--29
('Бутылка 1.5л', 196, 4),--30
('Бутылка 1.5л', 3, 4),--31
('Бутылка 2л', 9, 5),--32
('Бутылка 2л', 197, 5),--33
('Бутылка 2л', 18, 5),--34
('Бутылка 2.5л', 19, 6),--35
('Бутылка 2.5л', 102, 6),--36
('Бутылка 3л', 103, 7),--37
('Бутылка 3л', 104, 8),--38
('Бутылка 0.83л', 74, 9),--39
('Бутылка 0.9л', 13, 10),--40
('Бутылка 0.9л', 25, 10),--41
('Бутылка 0.45л', 8, 3),--42
('Бутылка 0.25л', 116, 11),--43
('Бутылка 0.3л', 132, 12),--44
('Бутылка 0.3л', 117, 12),--45
('Бутылка 0.33л', 133, 13),--46
('Бутылка 0.45л', 135, 3), --47
('Бутылка 0.2л', 136, 14), --48
('Бутылка 0.2л', 152, 15), --49
('Бутылка 0.4л', 134, 16), --50
('Бутылка 0.5л', 185, 1), --51
('Бутылка 0.25л', 193, 11),--52
('Бутылка 0.2л', 194, 15), --53
('Крышка на горло 28мм', 321, 22), --54
('Крышка на горло 38мм', 305, 22), --55
('Крышка на банку 65мм', 309, 23), --56
('Крышка на банку 110мм', 311, 23), --57
('Банка 0.5л', 123, 27), --58
('Банка 1л', 125, 17), --59
('Банка 0.5л', 126, 27), --60
('Банка 1л', 127, 17), --61
('Банка 1.04л', 173, 28), --62
('Банка 0.65л', 175, 29), --63
('Банка 0.45л', 176, 30), --64
('Банка 0.65л', 177, 29), --65
('Банка 0.76л', 179, 31), --66
('Банка 2л', 129, 18), --67
('Банка 3л', 130, 32), --68
('Банка 4л', 199, 33), --69
('Банка 5л', 200, 34), --70
('Банка 0.3л', 89, 35), --71
('Банка 0.5л', 90, 27), --72
('Банка 0.7л', 91, 36), --73
('Банка 1л', 92, 17); --74

INSERT INTO Zavod.product_characteristics(product_id, characteristic_id, val)
VALUES
(1, 4, 28),
(1, 3, 90),
(2, 4, 28),
(2, 3, 99),
(3, 4, 28),
(3, 3, 104),
(4, 4, 28),
(4, 3, 85),
(5, 4, 28),
(5, 3, 99),
(6, 4, 28),
(6, 3, 99),
(7, 4, 28),
(7, 3, 99),
(8, 4, 28),
(8, 3, 110),
(9, 4, 28),
(9, 3, 114),
(10, 4, 28),
(10, 3, 110),
(11, 4, 28),
(11, 3, 99),
(12, 4, 28),
(12, 3, 99),
(13, 4, 28),
(13, 3, 99),
(14, 4, 28),
(14, 3, 99),
(15, 4, 28),
(15, 3, 99),
(16, 4, 28),
(16, 3, 99),
(17, 4, 28),
(17, 3, 110),
(18, 4, 28),
(18, 3, 108),
(19, 4, 28),
(19, 3, 108),
(19, 5, 22.5),
(20, 4, 28),
(20, 3, 99),
(20, 5, 22.5),
(21, 4, 28),
(21, 3, 160),
(21, 5, 35),
(22, 4, 28),
(22, 3, 153),
(22, 5, 35),
(23, 4, 28),
(23, 3, 99),
(23, 5, 22.5),
(24, 4, 28),
(24, 3, 108),
(24, 5, 22.5),
(25, 4, 38),
(25, 3, 102),
(25, 5, 37),
(26, 4, 28),
(26, 3, 99),
(26, 5, 22.5),
(27, 4, 28),
(27, 3, 140),
(27, 5, 35),
(28, 4, 28),
(28, 3, 75),
(28, 5, 35),
(29, 4, 28),
(29, 3, 72),
(29, 5, 35),
(30, 4, 28),
(30, 3, 80),
(30, 5, 35),
(31, 4, 28),
(31, 3, 75),
(31, 5, 35),
(32, 4, 28),
(32, 3, 52),
(32, 5, 35),
(33, 4, 28),
(33, 3, 65),
(33, 5, 35),
(34, 4, 28),
(34, 3, 54),
(34, 5, 35),
(35, 4, 28),
(35, 3, 44),
(35, 5, 35),
(36, 4, 48),
(36, 3, 42),
(36, 5, 80),
(37, 4, 48),
(37, 3, 42),
(37, 5, 80),
(38, 4, 48),
(38, 3, 55),
(38, 5, 80),
(39, 4, 28),
(39, 3, 130),
(39, 5, 30),
(40, 4, 28),
(40, 3, 99),
(40, 5, 30),
(41, 4, 28),
(41, 3, 110),
(41, 5, 35),
(42, 4, 28),
(42, 3, 114),
(42, 5, 22.5),
(43, 4, 28),
(43, 3, 100),
(43, 5, 22.5),
(44, 4, 28),
(44, 3, 100),
(44, 5, 22.5),
(45, 4, 28),
(45, 3, 100),
(45, 5, 22.5),
(46, 4, 28),
(46, 3, 100),
(46, 5, 35),
(47, 4, 28),
(47, 3, 88),
(47, 5, 35),
(48, 4, 28),
(48, 3, 100),
(48, 5, 22.5),
(49, 4, 28),
(49, 3, 100),
(49, 5, 16.5),
(50, 4, 28),
(50, 3, 88),
(50, 5, 35),
(51, 4, 28),
(51, 3, 250),
(51, 5, 35),
(52, 4, 28),
(52, 3, 100),
(52, 5, 22.5),
(53, 4, 28),
(53, 3, 100),
(53, 5, 22.5),
(54, 6, 28),
(54, 3, 100),
(55, 6, 38),
(55, 3, 1),
(56, 6, 65),
(56, 3, 1),
(57, 6, 110),
(57, 3, 1),
(58, 5, 51),
(58, 3, 100),
(59, 5, 51),
(59, 3, 130),
(60, 5, 51),
(60, 3, 100),
(61, 5, 51),
(61, 3, 39),
(62, 5, 51),
(62, 3, 75),
(63, 5, 51),
(63, 3, 70),
(64, 5, 51),
(64, 3, 70),
(65, 5, 51),
(65, 3, 63),
(66, 5, 51),
(66, 3, 118),
(67, 5, 51),
(67, 3, 42),
(68, 5, 51),
(68, 3, 63),
(69, 5, 51),
(69, 3, 48),
(70, 5, 51),
(70, 3, 42),
(71, 5, 41),
(71, 3, 94),
(72, 5, 41),
(72, 3, 75),
(73, 5, 41),
(73, 3, 59),
(74, 5, 41),
(74, 3, 75);


INSERT INTO Zavod.images(product_id, product_image_type, product_image_name, color_id)
VALUES
(1, 'JPG', 'Бутылка-1л-28мм-90шт-прозрачная', 1),
(2, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(3, 'JPG', 'Бутылка-1л-28мм-104шт-прозрачная', 1),
(4, 'JPG', 'Бутылка-1л-28мм-85шт-прозрачная', 1),
(5, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(6, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(7, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(8, 'JPG', 'Бутылка-1л-28мм-99шт-коричневая', 3),
(9, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(10, 'JPG', 'Бутылка-1л-28мм-110шт-прозрачная', 1),--10
(11, 'JPG', 'Бутылка-1л-28мм-101шт-прозрачная', 1),
(12, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(13, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(14, 'JPG', 'Бутылка-1л-28мм-99шт-белая', 4),
(15, 'JPG', 'Бутылка-1л-28мм-99шт-прозрачная', 1),
(16, 'JPG', 'Бутылка-0.5л-28мм-99шт-прозрачная', 1),
(17, 'JPG', 'Бутылка-0.5л-28мм-110шт-коричневая', 3),
(18, 'JPG', 'Бутылка-0.5л-28мм-108шт-прозрачная', 1),
(19, 'JPG', 'Бутылка-0.5л-28мм-108шт-прозрачная', 1),
(20, 'JPG', 'Бутылка-0.5л-28мм-99шт-прозрачная', 1),--20
(21, 'JPG', 'Бутылка-0.5л-28мм-160шт-прозрачная', 1),
(22, 'JPG', 'Бутылка-0.5л-28мм-153шт-прозрачная', 1),
(22, 'JPG', 'Бутылка-0.5л-28мм-153шт-белая', 4),
(23, 'JPG', 'Бутылка-0.5л-28мм-99шт-прозрачная', 1),
(24, 'JPG', 'Бутылка-0.5л-28мм-108шт-прозрачная(82)', 1),
(17, 'JPG', 'Бутылка-0.5л-28мм-110шт-коричневая', 3),
(17, 'JPG', 'Бутылка-0.5л-28мм-110шт-прозрачная', 1),
(18, 'JPG', 'Бутылка-0.5л-28мм-108шт-прозрачная', 1),
(16, 'JPG', 'Бутылка-0.5л-28мм-99шт-прозрачная', 1),
(16, 'JPG', 'Бутылка-0.5л-28мм-99шт-белая', 4),--30
(25, 'JPG', 'Бутылка-0.5л-38мм-102шт-прозрачная', 1),
(25, 'JPG', 'Бутылка-0.5л-38мм-102шт-белая', 4),
(26, 'JPG', 'Бутылка-0.5л-28мм-99шт-прозрачная', 1),
(27, 'JPG', 'Бутылка-0.45л-28мм-140шт-прозрачная', 1),
(28, 'JPG', 'Бутылка-1.5л-28мм-75шт-прозрачная', 1),
(29, 'JPG', 'Бутылка-1.5л-28мм-72шт-прозрачная', 1),
(30, 'JPG', 'Бутылка-1.5л-28мм-80шт-прозрачная', 1),
(31, 'JPG', 'Бутылка-рыба', 1),
(32, 'JPG', 'Бутылка-2л-28мм-52шт-прозрачная', 1),
(33, 'JPG', 'Бутылка-2л-28мм-65шт-прозрачная', 1),
(34, 'JPG', 'Бутылка-2л-28мм-54шт-прозрачная', 1),
(35, 'JPG', 'Бутылка-2.5л-28мм-44шт-прозрачная', 1),--42
(36, 'JPG', 'Бутылка-2.5л-48мм-42шт-прозрачная', 1),--43
(37, 'JPG', 'Бутылка-3л-48мм-42шт-прозрачная', 1),--44
(38, 'JPG', 'Бутылка-4л-48мм-55шт-прозрачная', 1),--45
(39, 'JPG', 'Бутылка-0.83л-28мм-130шт-прозрачная', 1),--46
(39, 'JPG', 'Бутылка-0.83л-28мм-130шт-зеленая', 2),--47
(40, 'JPG', 'Бутылка-0.9л-28мм-99шт-прозрачная', 1),--48
(40, 'JPG', 'Бутылка-0.9л-28мм-99шт-голубая', 5),--49
(41, 'JPG', 'Бутылка-0.9л-28мм-110шт-прозрачная', 1),--50
(42, 'JPG', 'Бутылка-0.45л-28мм-114шт-прозрачная', 1),--51
(43, 'JPG', 'Бутылка-0.25л-28мм-100шт-прозрачная', 1),--52
(44, 'JPG', 'Бутылка-0.3л-28мм-100шт-прозрачная', 1),--53
(45, 'JPG', 'Бутылка-0.3л-28мм-100шт-прозрачная', 1),--54
(46, 'JPG', 'Бутылка-0.33л-28мм-100шт-прозрачная-1', 1),--55
(46, 'JPG', 'Бутылка-0.33л-28мм-100шт-прозрачная-2', 1),--56
(47, 'JPG', 'Бутылка-0.45л-28мм-88шт-прозрачная', 1),--57
(48, 'JPG', 'Бутылка-0.2л-28мм-100шт-прозрачная', 1),--58
(49, 'JPG', 'Бутылка-0.1л-28мм-100шт-прозрачная', 1),--59
(49, 'JPG', 'Бутылка-0.1л-28мм-100шт-коричневая', 3),--60
(50, 'JPG', 'Бутылка-0.4л-28мм-88шт-прозрачная', 1),--61
(51, 'JPG', 'Бутылка-0.5л-28мм-88шт-прозрачная-1', 1),--62
(51, 'JPG', 'Бутылка-0.5л-28мм-88шт-прозрачная-2', 1),--63
(52, 'JPG', 'Бутылка-0.25л-28мм-100шт-прозрачная', 1),--64
(53, 'JPG', 'Бутылка-0.2л-28мм-100шт-прозрачная', 1),--65
(54, 'JPG', 'Крышка-28мм-100шт-разноцветная', 1),--66
(55, 'JPG', 'Крышка-38мм-1шт-разноцветная', 1),--67
(56, 'JPG', 'Крышка-65мм-1шт-разноцветная', 1),--68
(57, 'JPG', 'Крышка-110мм-1шт-разноцветная', 1),--69
(58, 'JPG', 'Банка-0.5л-100шт-прозрачная', 1),--70
(59, 'JPG', 'Банка-1л-130шт-прозрачная-1', 1),--71
(59, 'JPG', 'Банка-1л-130шт-прозрачная-2', 1),--72
(60, 'JPG', 'Банка-0.5л-100шт-прозрачная', 1),--73
(61, 'JPG', 'Банка-1л-39шт-прозрачная', 1),--74
(62, 'JPG', 'Банка-1.04л-75шт-прозрачная', 1),--75
(63, 'JPG', 'Банка-0.65л-70шт-прозрачная', 1),--76
(63, 'JPG', 'Банка-0.45л-70шт-прозрачная', 1),--77
(65, 'JPG', 'Банка-0.65л-63шт-прозрачная-1', 1),--78
(65, 'JPG', 'Банка-0.65л-63шт-прозрачная-2', 1),--79
(66, 'JPG', 'Банка-0.76л-63шт-прозрачная', 1),--80
(67, 'JPG', 'Банка-2л-42шт-прозрачная', 1),--81
(68, 'JPG', 'Банка-3л-63шт-прозрачная', 1),--82
(69, 'JPG', 'Банка-4л-48шт-прозрачная-1', 1),--83
(69, 'JPG', 'Банка-4л-48шт-прозрачная-2', 1),--84
(70, 'JPG', 'Банка-5л-42шт-прозрачная', 1),--85
(71, 'JPG', 'Банка-0.3л-94шт-прозрачная-1', 1),--86
(71, 'JPG', 'Банка-0.3л-94шт-прозрачная-2', 1),--87
(72, 'JPG', 'Банка-0.5л-75шт-прозрачная', 1),--88
(73, 'JPG', 'Банка-0.7л-59шт-прозрачная', 1),--89
(74, 'JPG', 'Банка-затычка', 1);--90

INSERT INTO Zavod.capacity(capacity_from, capacity_to)
VALUES
(0, 800),
(800, 1300),
(1300, 2500),
(2500, 6000),
(6000, 10000),
(10000, 12000),
(12000, 15000),
(15000, 18000),
(18000, 20000),
(20000, 25000),
(25000, 30000);

INSERT INTO Zavod.division(name)
VALUES
('Город'),
('Запад'),
('Восток');

INSERT INTO Zavod.district(name, division_id)
VALUES
('Зона 1', 1),
('Зона 2', 1),
('Зона 3', 1),
('Зона 4', 1),
('Сокулук', 2),
('Кара-Балта', 2),
('Ленинское', 3),
('Кант', 3),
('Токмок', 3),
('Чолпон-Ата', 3);

INSERT INTO Zavod.delivery_prices(capacity_id, district_id, price)
VALUES
(1, 1, 162),
(2, 1, 210),
(3, 1, 303),
(4, 1, 436),
(5, 1, 587),
(6, 1, 754),
(7, 1, 805),
(8, 1, 923),
(9, 1, 1076),
(10, 1, 1374),
(11, 1, 1691),
(1, 2, 236),
(2, 2, 252),
(3, 2, 420),
(4, 2, 587),
(5, 2, 706),
(6, 2, 845),
(7, 2, 923),
(8, 2, 1076),
(9, 2, 1231),
(10, 2, 1615),
(11, 2, 1938),
(1, 3, 419),
(2, 3, 504),
(3, 3, 587),
(4, 3, 671),
(5, 3, 799),
(6, 3, 1024),
(7, 3, 1108),
(8, 3, 1231),
(9, 3, 1384),
(10, 3, 1906),
(11, 3, 2213),
(1, 4, 587),
(2, 4, 671),
(3, 4, 754),
(4, 4, 769),
(5, 4, 923),
(6, 4, 1076),
(7, 4, 1231),
(8, 4, 1384),
(9, 4, 1537),
(10, 4, 2151),
(11, 4, 2460),
(1, 5, 1118),
(2, 5, 1300),
(3, 5, 1462),
(4, 5, 1537),
(5, 5, 1615),
(6, 5, 1920),
(7, 5, 1998),
(8, 5, 2151),
(9, 5, 2460),
(10, 5, 3460),
(11, 5, 3689),
(1, 6, null),
(2, 6, null),
(3, 6, null),
(4, 6, 2460),
(5, 6, 2768),
(6, 6, 3229),
(7, 6, 3535),
(8, 6, 3851),
(9, 6, 3997),
(10, 6, 6303),
(11, 6, 7072),
(1, 7, 1118),
(2, 7, 1300),
(3, 7, 1462),
(4, 7, 1537),
(5, 7, 1615),
(6, 7, 1920),
(7, 7, 1998),
(8, 7, 2151),
(9, 7, 2460),
(10, 7, 3460),
(11, 7, 3689),
(1, 8, 1462),
(2, 8, null),
(3, 8, 1691),
(4, 8, 1845),
(5, 8, 1998),
(6, 8, 2153),
(7, 8, 2307),
(8, 8, 2768),
(9, 8, 3075),
(10, 8, 4305),
(11, 8, 4612),
(1, 9, null),
(2, 9, null),
(3, 9, null),
(4, 9, 2460),
(5, 9, 2758),
(6, 9, 3229),
(7, 9, 3535),
(8, 9, 3851),
(9, 9, 3997),
(10, 9, 6303),
(11, 9, 7072),
(1, 10, null),
(2, 10, null),
(3, 10, null),
(4, 10, null),
(5, 10, 7050),
(6, 10, 8450),
(7, 10, 9224),
(8, 10, 10764),
(9, 10, 12298),
(10, 10, 16910),
(11, 10, 18440);

INSERT INTO Zavod.notices(title, description, is_active, notice_image_name, image_type)
VALUES
('Новость 1', 'Описание новости 1', 1, 'Новость-1', 'JPG'),
('Новость 2', 'Описание новости 2', 1, 'Новость-2', 'JPG');

INSERT INTO Zavod.partners(name, description, logo_image_name, logo_image_type, product_image_name, product_image_type, is_active)
VALUES
('Партнер-1', 'Описание партнера 1', 'логотип-партнер-1', 'JPG', 'продукт-партнера-1', 'JPG', 1),
('Партнер-2', 'Описание партнера 2', 'логотип-партнер-2', 'JPG', 'продукт-партнера-2', 'JPG', 1);

INSERT INTO Zavod.vacancies(name, description, offer)
VALUES
('Вакансия грузчика', 'Работа грузчиком на заводе', 'Предлагаем работу грузчиком.&#10;• График работы: 6/1&#10;• ЗП: 10000 сом'),
('Вакансия ', 'Работа грузчиком на заводе', 'Предлагаем работу грузчиком.&#10;• График работы: 6/1&#10;• ЗП: 10000 сом');

INSERT INTO Zavod.certificates(name, description, certificate_image_name, certificate_image_type)
VALUES
('Сертификат-1', 'Сертификат бутылочный', 'сертификат-1', 'JPG');