INSERT INTO Zavod.roles(role)
VALUES
('DEVELOPER'),
('ADMIN');

INSERT INTO Zavod.users(username, name, surname, patronymic, password, is_deleted)
VALUES
('isakhno', 'Ярослав', 'Сахно', 'Андреевич', '$2a$10$DimBen9baU6AzZi.O2q/WusIS6OflyWa092jAIaqdfQ8GevBrta8S', 0),
('amusina', 'Анастасия', 'Мусина', 'Руслановна', '$2a$10$DimBen9baU6AzZi.O2q/WusIS6OflyWa092jAIaqdfQ8GevBrta8S', 0);

INSERT INTO Zavod.user_role(user_id, role_id)
VALUES
(1,1),
(2,2);

INSERT INTO Zavod.categories(name, category_image_name, category_image_type)
VALUES
('Бутылки', 'бутылка', 'JPG'),
('Банки', 'банка', 'JPG'),
('Преформы', 'пре-форма', 'JPG'),
('Крышки', 'крышка', 'JPG'),
('Флекс', 'стружка', 'JPG');

INSERT INTO Zavod.subcategories(name, category_id)
VALUES
('Бутылки до 0.5л', 1),--1
('Бутылки от 0.5л до 1л', 1),--2
('Бутылки от 1л до 2л', 1),--3
('Бутылки от 2л до 5л', 1),--4
('Бутылки от 5л до 10л', 1),--5
('Банки до 0.5л', 2),--6
('Банки от 0.5л до 1л', 2),--7
('Банки от 1л до 2л', 2),--8
('Банки от 2л до 5л', 2),--9
('Банки малыши', 2),--10
('Пре форма 0.5 л', 3),--11
('Пре форма 1 л', 3),--12
('Пре форма 1.5 л', 3),--13
('Крышки на бутылку', 4),--14
('Крышки на банку', 4),--15
('Флекс лента', 5),--16
('Флекс стружка', 5);--17

INSERT INTO Zavod.colors(name, hex_code)
VALUES
('Прозрачный', '#FFFFFF00'),
('Зеленый', '#219c23'),
('Коричневый', '#994d17'),
('Белый', '#fcf9f7'),
('Голубой', '#99CCFF');

INSERT INTO Zavod.characteristics(name)
VALUES
('Цена, сом'),
('Объем, л'),
('Фасовка, шт'),
('Диаметр горлышка, мм'),
('Масса, г'),
('Диаметр, мм');--6

INSERT INTO Zavod.capacity(capacity_from, capacity_to)
VALUES
(0, 800),
(800, 1300),
(1300, 2500),
(2500, 6000),
(6000, 10000),
(10000, 12000),
(12000, 15000),
(15000, 18000),
(18000, 20000),
(20000, 25000),
(25000, 30000);

INSERT INTO Zavod.division(name)
VALUES
('Город'),
('Запад'),
('Восток');

INSERT INTO Zavod.district(name, division_id)
VALUES
('Зона 1', 1),
('Зона 2', 1),
('Зона 3', 1),
('Зона 4', 1),
('Сокулук', 2),
('Кара-Балта', 2),
('Ленинское', 3),
('Кант', 3),
('Токмок', 3),
('Чолпон-Ата', 3);

INSERT INTO Zavod.delivery_prices(capacity_id, district_id, price)
VALUES
(1, 1, 162),
(2, 1, 210),
(3, 1, 303),
(4, 1, 436),
(5, 1, 587),
(6, 1, 754),
(7, 1, 805),
(8, 1, 923),
(9, 1, 1076),
(10, 1, 1374),
(11, 1, 1691),
(1, 2, 236),
(2, 2, 252),
(3, 2, 420),
(4, 2, 587),
(5, 2, 706),
(6, 2, 845),
(7, 2, 923),
(8, 2, 1076),
(9, 2, 1231),
(10, 2, 1615),
(11, 2, 1938),
(1, 3, 419),
(2, 3, 504),
(3, 3, 587),
(4, 3, 671),
(5, 3, 799),
(6, 3, 1024),
(7, 3, 1108),
(8, 3, 1231),
(9, 3, 1384),
(10, 3, 1906),
(11, 3, 2213),
(1, 4, 587),
(2, 4, 671),
(3, 4, 754),
(4, 4, 769),
(5, 4, 923),
(6, 4, 1076),
(7, 4, 1231),
(8, 4, 1384),
(9, 4, 1537),
(10, 4, 2151),
(11, 4, 2460),
(1, 5, 1118),
(2, 5, 1300),
(3, 5, 1462),
(4, 5, 1537),
(5, 5, 1615),
(6, 5, 1920),
(7, 5, 1998),
(8, 5, 2151),
(9, 5, 2460),
(10, 5, 3460),
(11, 5, 3689),
(1, 6, null),
(2, 6, null),
(3, 6, null),
(4, 6, 2460),
(5, 6, 2768),
(6, 6, 3229),
(7, 6, 3535),
(8, 6, 3851),
(9, 6, 3997),
(10, 6, 6303),
(11, 6, 7072),
(1, 7, 1118),
(2, 7, 1300),
(3, 7, 1462),
(4, 7, 1537),
(5, 7, 1615),
(6, 7, 1920),
(7, 7, 1998),
(8, 7, 2151),
(9, 7, 2460),
(10, 7, 3460),
(11, 7, 3689),
(1, 8, 1462),
(2, 8, null),
(3, 8, 1691),
(4, 8, 1845),
(5, 8, 1998),
(6, 8, 2153),
(7, 8, 2307),
(8, 8, 2768),
(9, 8, 3075),
(10, 8, 4305),
(11, 8, 4612),
(1, 9, null),
(2, 9, null),
(3, 9, null),
(4, 9, 2460),
(5, 9, 2758),
(6, 9, 3229),
(7, 9, 3535),
(8, 9, 3851),
(9, 9, 3997),
(10, 9, 6303),
(11, 9, 7072),
(1, 10, null),
(2, 10, null),
(3, 10, null),
(4, 10, null),
(5, 10, 7050),
(6, 10, 8450),
(7, 10, 9224),
(8, 10, 10764),
(9, 10, 12298),
(10, 10, 16910),
(11, 10, 18440);

INSERT INTO Zavod.notices(title, description, is_active, notice_image_name, image_type)
VALUES
('Новость 1', 'Описание новости 1', 1, 'Новость-1', 'JPG'),
('Новость 2', 'Описание новости 2', 1, 'Новость-2', 'JPG');

INSERT INTO Zavod.partners(name, description, logo_image_name, logo_image_type, product_image_name, product_image_type, is_active)
VALUES
('Партнер-1', 'Описание партнера 1', 'логотип-партнер-1', 'JPG', 'продукт-партнера-1', 'JPG', 1),
('Партнер-2', 'Описание партнера 2', 'логотип-партнер-2', 'JPG', 'продукт-партнера-2', 'JPG', 1);

INSERT INTO Zavod.vacancies(name, description, offer)
VALUES
('Вакансия грузчика', 'Работа грузчиком на заводе', 'Предлагаем работу грузчиком.&#10;• График работы: 6/1&#10;• ЗП: 10000 сом'),
('Вакансия ', 'Работа грузчиком на заводе', 'Предлагаем работу грузчиком.&#10;• График работы: 6/1&#10;• ЗП: 10000 сом');

INSERT INTO Zavod.certificates(name, description, certificate_image_name, certificate_image_type)
VALUES
('Сертификат-1', 'Сертификат бутылочный', 'сертификат-1', 'JPG');